butterfli-api/app/controllers/dashes_controller.rb

SELECT "dashes".* FROM "dashes" WHERE "dashes"."user_id" = 1
---
  def index
    @dashes = Dash.all.where(user_id: current_user)